{
  "WELCOME": [
    "Welcome to Bulls and Cows. This is a game to guess three digit numbers which are different. You can ask the rule of this game. Let' start. Please say three digit numbers.",
    "Let's play Bulls and Cows. This is a game to guess three digit numbers which are different. You can ask the rule of this game. Ok, please say three digit numbers."
  ],
  "QUIT": [
    "The answer was %s, %s and %s. See you next time.",
    "The answer was %s, %s and %s. See you later."
  ],
  "PLAY_AGAIN_YES": "Thank you. I'm thinking new numbers. Ok, please say three digit numbers.",
  "PLAY_AGAIN_NO": [
    "See you next time.",
    "See you later."
  ],
  "INPUT_UNKNOWN_PLAY_AGAIN": [
    "I didn't understand what you said. Do you want to continue?",
    "I didn't hear you. Do you want to play again?"
  ],
  "INPUT_UNKNOWN_GAME": [
    "I didn't understand what you said. Please say three digit numbers.",
    "I didn't hear you well. Please say three digit numbers.",
    "What did you say? Please say three digit numbers."
  ],
  "3HIT": [
    "Congratulation! You got three Bulls! Do you want to play again?",
    "Great! You got three Bulls! Do you want to play again?",
    "Wow! You got three Bulls! Wow! Do you want to play again?"
  ],
  "INVALID_NUMBER": [
    "Please say three different numbers without zero.",
    "All numbers should be different totally, and not include zero. Please say three digit numbers."
  ],
  "HIT_AND_BLOW": [
    "%s Bulls, %s Cows.",
    "%s Bulls and %s Cows."
  ],
  "ALMOST": [
    "The goal is close.",
    "The numbers are almost correct.",
    "You will be able to get correct numbers soon."
  ],
  "NOTHING": [
    "The correct numbers don't contain these numbers.",
    "You can forget those numbers."
  ],
  "HINT1": "The sum of three digit numbers is %s.",
  "HINT2": "There is the number %s in the correct numbers.",
  "RULE": "This is a game to guess three different digit numbers besides zero. If the position of the number match, it means Bulls. In the other hand, if the position is different, it means Cows. To get three Bulls, do your best!",
  "NO_INPUT_GAME": [
    "I didn't understand what you said. Please say three digit numbers.",
    "Are you until there? Please say three digit numbers."
  ],
  "NO_INPUT_PLAY_AGAIN": [
    "I didn't understand what you said. Do you want to continue?",
    "Are you until there? Do you want to play again?"
  ],
  "UPDATE_ANSWER": "The answer updated.",
  "SUGGEST_HINT": [
    "Do you need a hint?",
    "Can I provide you a hint?",
    "Do you want to hear a hint?"
  ],
  "HEAR_HINT_NO": [
    "I see. Please say three digit numbers.",
    "Ok, we continue. Please say three digit numbers.",
    "Ok, please say three digit numbers."
  ]
}
